'''
4. ООП

Напишите класс, представляющий объекты типа "трехмерный вектор". 

По заданным трем координатам должен создаваться объект, представляющий вектор и поддерживающий следующие операции:
- сложение вычитание векторов
- умножение и деление вектора на число
- скалярное умножение векторов
- определение длины вектора

Пример возможного использования класса:
a = MyVector(1,2,3)
b = MyVector(3,2,1)

print(a + b)
print(2*a + 3*b)
print(a*b)
print(len(a))
print(len(b))
'''
